In [1]:
import pandas as pd
import numpy as np

In [2]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,5],'C':[1,2,3]}

In [3]:
df  = pd.DataFrame(d)

In [4]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [6]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [7]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [8]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [9]:
df.fillna(method='ffill')

C:\Users\User\AppData\Local\Temp\ipykernel_16744\1193302488.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

In [10]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [12]:
df.ffill()

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

In [13]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [14]:
df.bfill()

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [15]:
p = {'A':[1,2,np.nan],'B':[5,np.nan,5],'C':[1,2,3]}

In [16]:
df = pd.DataFrame(p)

In [17]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  5.0  3

In [18]:
df.bfill()

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  NaN  5.0  3